; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v6 ?v7)
		(pred_3 ?v2)
		(pred_6 ?v1)
		(pred_5 ?v1)
		(pred_1 ?v2 ?v1)
		(pred_4)
		(pred_2 ?v2))

   (:action op_3
       :parameters  (?v8 ?v3)
       :precondition (and (not-eq ?v8 ?v3) 
                          (pred_6 ?v8) (pred_6 ?v3) (pred_5 ?v8))
       :effect (and  (pred_5 ?v3)
		     (not (pred_5 ?v8))))


   (:action op_1
       :parameters (?v5 ?v4)
       :precondition  (and  (pred_3 ?v5) (pred_6 ?v4)
			    (pred_1 ?v5 ?v4) (pred_5 ?v4) (pred_4))
       :effect (and (pred_2 ?v5)
		    (not (pred_1 ?v5 ?v4)) 
		    (not (pred_4))))

   (:action op_2
       :parameters  (?v5  ?v4)
       :precondition  (and  (pred_3 ?v5) (pred_6 ?v4)
			    (pred_2 ?v5) (pred_5 ?v4))
       :effect (and (pred_1 ?v5 ?v4)
		    (pred_4)
		    (not (pred_2 ?v5)))))

; problem
(define (problem ferry-l4-c3)
(:domain ferry)
(:objects obj_04 obj_03 obj_01 obj_05 
          obj_02 obj_06 obj_07 
)
(:init
(pred_6 obj_04)
(pred_6 obj_03)
(pred_6 obj_01)
(pred_6 obj_05)
(pred_3 obj_02)
(pred_3 obj_06)
(pred_3 obj_07)
(not-eq obj_04 obj_03)
(not-eq obj_03 obj_04)
(not-eq obj_04 obj_01)
(not-eq obj_01 obj_04)
(not-eq obj_04 obj_05)
(not-eq obj_05 obj_04)
(not-eq obj_03 obj_01)
(not-eq obj_01 obj_03)
(not-eq obj_03 obj_05)
(not-eq obj_05 obj_03)
(not-eq obj_01 obj_05)
(not-eq obj_05 obj_01)
(pred_4)
(pred_1 obj_02 obj_03)
(pred_1 obj_06 obj_01)
(pred_1 obj_07 obj_05)
(pred_5 obj_04)
)
(:goal
(and
(pred_1 obj_02 obj_03)
(pred_1 obj_06 obj_04)
(pred_1 obj_07 obj_05)
)
)

(:constraints
  (sometime-before  (pred_1 obj_06 obj_04) (pred_5 obj_03))
)
)

; plan
1. (op_3 obj_04 obj_03)
   deleted: (pred_5 obj_04)
   added: (pred_5 obj_03)
   goals met: 2 of 3
2. (op_1 obj_02 obj_03)
   deleted: (pred_1 obj_02 obj_03) (pred_4)
   added: (pred_2 obj_02)
   goals met: 1 of 3
3. (op_3 obj_03 obj_01)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_01)
   goals met: 1 of 3
4. (op_2 obj_02 obj_01)
   deleted: (pred_2 obj_02)
   added: (pred_1 obj_02 obj_01) (pred_4)
   goals met: 1 of 3
5. (op_1 obj_06 obj_01)
   deleted: (pred_1 obj_06 obj_01) (pred_4)
   added: (pred_2 obj_06)
   goals met: 1 of 3
6. (op_3 obj_01 obj_04)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_04)
   goals met: 1 of 3
7. (op_2 obj_06 obj_04)
   deleted: (pred_2 obj_06)
   added: (pred_1 obj_06 obj_04) (pred_4)
   goals met: 2 of 3
8. (op_3 obj_04 obj_01)
   deleted: (pred_5 obj_04)
   added: (pred_5 obj_01)
   goals met: 2 of 3
9. (op_1 obj_02 obj_01)
   deleted: (pred_1 obj_02 obj_01) (pred_4)
   added: (pred_2 obj_02)
   goals met: 2 of 3
10. (op_3 obj_01 obj_03)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_03)
   goals met: 2 of 3
11. (op_2 obj_02 obj_03)
   deleted: (pred_2 obj_02)
   added: (pred_1 obj_02 obj_03) (pred_4)
   goals met: 3 of 3
